<?php
/**
 * Список массивов для задачи с актерами и фильмами
 *
 */

$actors = [
    [
        'id' => 1,
        'actor' => "Леонардо Ди Каприо",
        'url' => ""
    ],
    [
        'id' => 2,
        'actor' => "Брэд Пит",
        'url' => ""
    ],
    [
        'id' => 3,
        'actor' => "Джонни Дэп",
        'url' => ""
    ],
    [
        'id' => 4,
        'actor' => "Уилл Смит",
        'url' => ""
    ],
    [
        'id' => 7,
        'actor' => "Том Круз",
        'url' => ""
    ],
];

$films = [
    [
        'id' => 1,
        'film' => "Титаник",
        'imdb' => 8.1
    ],
    [
        'id' => 1,
        'film' => "Поймай меня если сможеш",
        'imdb' => 7
    ],
    [
        'id' => 2,
        'film' => "Большой куш",
        'imdb' => 5
    ],
    [
        'id' => 2,
        'film' => "Троя",
        'imdb' => 6
    ],
    [
        'id' => 3,
        'film' => "Пираты Карибского моря",
        'imdb' => 8
    ],
    [
        'id' => 3,
        'film' => "Чарли и шоколадная фабрика",
        'imdb' => 7.5
    ],
    [
        'id' => 4,
        'film' => "Я - легенда",
        'imdb' => 8
    ],
    [
        'id' => 2,
        'film' => "Ярость",
        'imdb' => 3
    ],
    [
        'id' => 3,
        'film' => "Алиса в стране чудес",
        'imdb' => 8
    ],
    [
        'id' => 7,
        'film' => "Обливион",
        'imdb' => 6.3
    ],
    [
        'id' => 7,
        'film' => "Миссия невыполнима",
        'imdb' => 7.7
    ]
];

?>