<?php

/**
 * Сделайте скрипт-гороскоп. Внутри него хранится массив гороскопов
 * на несколько дней вперед для каждого знака зодиака. По заходу на страницу спросите у пользователя дату рождения,
 * определите его знак зодиака и выведите предсказание для этого знака зодиака на текущий день.
 *
 */

$goroskop = [
    1 => "Все хорошо",
    2 => "Все очень хорошо",
    3 => "Все еще хорошо",
    4 => "Все не так хорошо",
    5 => "Все будет",
    6 => "Все хорошо",
    7 => "Все хорошо очень",
    8 => "Все гуд",
    9 => "Все хорошо",
    10 => "Все хорошо",
    11 => "Все хорошо",
    12 => "Все хорошо",
];

$zodiak = [
    1 => "Овен",
    2 => "Телец",
    3 => "Близнецы",
    4 => "Рак",
    5 => "Лев",
    6 => "Дева",
    7 => "Весы",
    8 => "Скорпион",
    9 => "Стрелец",
    10 => "Козерог",
    11 => "Водолей",
    12 => "Рыбы",
];

$all =[
    [
      "name" => "Овен",
      "from" => "21.03",
      "to"   => "20.04",
      "text" => "Все хорошо"
    ],
    [
      "name" => "Телец",
      "from" => "21.04",
      "to"   => "21.05",
      "text" => "Все очень хорошо"
    ],
    [
      "name" => "Близнецы",
      "from" => "22.05",
      "to"   => "21.06",
      "text" => "Все еще хорошо"
    ],
    [
      "name" => "Рак",
      "from" => "22.06",
      "to"   => "22.07",
      "text" => "Все не так хорошо"
    ],
    [
      "name" => "Лев",
      "from" => "23.07",
      "to"   => "21.08",
      "text" => "Все будет"
    ],
    [
      "name" => "Дева",
      "from" => "22.08",
      "to"   => "23.09",
      "text" => "Все хорошо"
    ],
    [
      "name" => "Весы",
      "from" => "24.09",
      "to"   => "23.10",
      "text" => "Все Очень Очень Хорошо"
    ],
    [
      "name" => "Скорпион",
      "from" => "24.10",
      "to"   => "22.11",
      "text" => "хорошо"
    ],
    [
      "name" => "Стрелец",
      "from" => "23.11",
      "to"   => "22.12",
      "text" => "хорошо хорошо"
    ],
    [
      "name" => "Козерог",
      "from" => "23.12",
      "to"   => "20.01",
      "text" => "Все все"
    ],
    [
      "name" => "Водолей",
      "from" => "21.01",
      "to"   => "19.02",
      "text" => "Все хорошо"
    ],
    [
      "name" => "Рыбы",
      "from" => "20.02",
      "to"   => "20.03",
      "text" => "Все хорошо"
    ]
];

if(isset($_POST['date']) && !empty($_POST['date'])) {
//    var_dump($_POST);

    $date = $_POST['date'];
    $date_b =  strtotime(date("d.m.Y", strtotime($_POST['date'])));
//echo date("d.m.Y", strtotime($_POST['date']));

    foreach ($all as $key => $value) {

        if (strtotime($value['from'].".".date('Y')) <= ($date_b) && strtotime($value['to'].".".date('Y')) >= ($date_b) ) {
            echo "Ваш день рохдения ". date("d.m.Y", strtotime($_POST['date']))." Вы ".$value['name'].". Гороскоп - ".$value['text'];
        }

    }
};



?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
<pre></pre>

<hr>
<form action="lesson9.php" method="post">
    <div>
        <input type="date" name="date" placeholder="Ваш день рождения">
    </div>
    <div>
        <button type="submit" name="form_send" value="yes">Узнать гороскоп</button>
    </div>
</form>

<hr>

</body>
</html>
<pre>
